In [1]:
import pandas as pd
import numpy as np

Data Analysis
1. Description
2. Diagnosis
3. Prediction
4. Action/Prescription

In [17]:
#The column names
cols=['user_id','movie_id','rating','ts']

In [22]:
#Read the file
df= pd.read_csv('u.data',sep='\t',names=cols)

In [44]:
a=[4,8,2,7,9]

In [46]:
#b=[8,16,4,14,18]

b=[]
for i in a:
    b.append(i*2)
b

[8, 16, 4, 14, 18]

In [47]:
b=[i*2 for i in a]
b

[8, 16, 4, 14, 18]

In [48]:
item_cols=['movie_id','title']+[str(i) for i in range(22)]

In [69]:
#Read the other file
df1=pd.read_csv('u.item',sep='|',names=item_cols,encoding = "ISO-8859-1")[['movie_id','title']]

In [70]:
df1.shape

(1682, 2)

Exploratory Data Analysis(EDA)

In [71]:
df.sample(5)

       user_id  movie_id  rating         ts
58292      753       510       4  891401457
12790       18        64       5  880132501
27407      525       281       3  881086562
12857      331       702       3  877196443
17044      222      1029       1  881060608

In [72]:
df1.sample(3)

      movie_id                      title
1033      1034          Quest, The (1996)
1442      1443           8 Seconds (1994)
1081      1082  Female Perversions (1996)

In [73]:
df.head()

   user_id  movie_id  rating         ts
0        0        50       5  881250949
1        0       172       5  881250949
2        0       133       1  881250949
3      196       242       3  881250949
4      186       302       3  891717742

In [74]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100003 entries, 0 to 100002
Data columns (total 4 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   user_id   100003 non-null  int64
 1   movie_id  100003 non-null  int64
 2   rating    100003 non-null  int64
 3   ts        100003 non-null  int64
dtypes: int64(4)
memory usage: 3.1 MB

In [75]:
df.describe(include='all')

             user_id       movie_id         rating            ts
count  100003.000000  100003.000000  100003.000000  1.000030e+05
mean      462.470876     425.520914       3.529864  8.835288e+08
std       266.622454     330.797791       1.125704  5.343791e+06
min         0.000000       1.000000       1.000000  8.747247e+08
25%       254.000000     175.000000       3.000000  8.794487e+08
50%       447.000000     322.000000       4.000000  8.828269e+08
75%       682.000000     631.000000       4.000000  8.882600e+08
max       943.000000    1682.000000       5.000000  8.932866e+08

Try to find the Different Data
1. Strings with Categorical Info
2. Strings with Random Stuff
3. Numbers with Quantified Stuff
4. Numbers with Categorical Info
5. Random Numbers or ID sort of Data

In [76]:
df.columns

Index(['user_id', 'movie_id', 'rating', 'ts'], dtype='object')

In [77]:
df['rating'].unique()

array([5, 1, 3, 2, 4], dtype=int64)

In [78]:
df['rating'].nunique()

5

In [79]:
df['user_id'].nunique()

944

In [80]:
df['movie_id'].nunique()

1682

In [81]:
#Merging Dataframes

In [84]:
movie=pd.merge(df, df1, on='movie_id')
movie.head()

   user_id  movie_id  rating         ts             title
0        0        50       5  881250949  Star Wars (1977)
1      290        50       5  880473582  Star Wars (1977)
2       79        50       4  891271545  Star Wars (1977)
3        2        50       5  888552084  Star Wars (1977)
4        8        50       5  879362124  Star Wars (1977)

In [85]:
#Remove the redundant or useless columns i.e. ts
movie.drop('ts',axis=1,inplace=True)

In [86]:
movie.head()

   user_id  movie_id  rating             title
0        0        50       5  Star Wars (1977)
1      290        50       5  Star Wars (1977)
2       79        50       4  Star Wars (1977)
3        2        50       5  Star Wars (1977)
4        8        50       5  Star Wars (1977)

In [87]:
movie.columns

Index(['user_id', 'movie_id', 'rating', 'title'], dtype='object')

In [89]:
#Find the no of rating for each movie
movie['title'].value_counts().head(10)

Star Wars (1977)                 584
Contact (1997)                   509
Fargo (1996)                     508
Return of the Jedi (1983)        507
Liar Liar (1997)                 485
English Patient, The (1996)      481
Scream (1996)                    478
Toy Story (1995)                 452
Air Force One (1997)             431
Independence Day (ID4) (1996)    429
Name: title, dtype: int64

In [95]:
#Find the average rating of each movie
movie.groupby('title')['rating'].mean().sort_values(ascending=False).head(10)

title
They Made Me a Criminal (1939)                       5.0
Marlene Dietrich: Shadow and Light (1996)            5.0
Saint of Fort Washington, The (1993)                 5.0
Someone Else's America (1995)                        5.0
Star Kid (1997)                                      5.0
Great Day in Harlem, A (1994)                        5.0
Aiqing wansui (1994)                                 5.0
Santa with Muscles (1996)                            5.0
Prefontaine (1997)                                   5.0
Entertaining Angels: The Dorothy Day Story (1996)    5.0
Name: rating, dtype: float64